# Описание задачи

## Условие задачи
Написать программу, которая из имеющегося массива строк формирует массив из строк, длина которых меньше либо равна 3 символа. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

## Решение задачи
Данную задачу можно решить различными методами и вариантами.

### Для простоты решения воспользуемся следующими шагами:
- На консоли введём произвольно некий массив на старте выполнения алгоритма. Назовём его **"array[i]"**;
- Присвоим некие значения массиву. К примеру: *1, 2, 3, 9, -8, 6, 0, -4.*
- В итоге на выходе получим следующий массив: **array = {1, 2, 3, 9, -8, 6, 0, -4}.**

### Использование цикла
Для решения задачи используем цикл **for.** Введём счётчик следующий: **for(int i = 0; i < array.Length; i++)**. Соответственно все значения будут проходиться по данному счётчику до тех пор, пока не достигнется последнее значение в массиве. В итоге через команду **Console.Write(array[i] + " ") массив выведится на консоль.